; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p14---int100n150-m25---int100c200---s527---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 level141 level142 level143 level144 level145 level146 level147 level148 level149 level150 level151 level152 level153 level154 level155 level156 level157 level158 level159 level160 - fuellevel
)

(:init
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level8 level31)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level8 level32)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level8 level33)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level8 level34)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level8 level35)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level8 level36)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level8 level37)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level8 level38)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level8 level39)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level8 level40)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level8 level41)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level8 level42)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level8 level43)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level8 level44)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level8 level45)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level8 level46)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level8 level47)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level8 level48)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level8 level49)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level8 level50)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level8 level51)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level8 level52)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level8 level53)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level8 level54)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level8 level55)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level8 level56)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level8 level57)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level8 level58)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level8 level59)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level51 level23 level74)
(sum level51 level25 level76)
(sum level52 level8 level60)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level52 level23 level75)
(sum level52 level25 level77)
(sum level53 level8 level61)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level53 level23 level76)
(sum level53 level25 level78)
(sum level54 level8 level62)
(sum level54 level15 level69)
(sum level54 level19 level73)
(sum level54 level23 level77)
(sum level54 level25 level79)
(sum level55 level8 level63)
(sum level55 level15 level70)
(sum level55 level19 level74)
(sum level55 level23 level78)
(sum level55 level25 level80)
(sum level56 level8 level64)
(sum level56 level15 level71)
(sum level56 level19 level75)
(sum level56 level23 level79)
(sum level56 level25 level81)
(sum level57 level8 level65)
(sum level57 level15 level72)
(sum level57 level19 level76)
(sum level57 level23 level80)
(sum level57 level25 level82)
(sum level58 level8 level66)
(sum level58 level15 level73)
(sum level58 level19 level77)
(sum level58 level23 level81)
(sum level58 level25 level83)
(sum level59 level8 level67)
(sum level59 level15 level74)
(sum level59 level19 level78)
(sum level59 level23 level82)
(sum level59 level25 level84)
(sum level60 level8 level68)
(sum level60 level15 level75)
(sum level60 level19 level79)
(sum level60 level23 level83)
(sum level60 level25 level85)
(sum level61 level8 level69)
(sum level61 level15 level76)
(sum level61 level19 level80)
(sum level61 level23 level84)
(sum level61 level25 level86)
(sum level62 level8 level70)
(sum level62 level15 level77)
(sum level62 level19 level81)
(sum level62 level23 level85)
(sum level62 level25 level87)
(sum level63 level8 level71)
(sum level63 level15 level78)
(sum level63 level19 level82)
(sum level63 level23 level86)
(sum level63 level25 level88)
(sum level64 level8 level72)
(sum level64 level15 level79)
(sum level64 level19 level83)
(sum level64 level23 level87)
(sum level64 level25 level89)
(sum level65 level8 level73)
(sum level65 level15 level80)
(sum level65 level19 level84)
(sum level65 level23 level88)
(sum level65 level25 level90)
(sum level66 level8 level74)
(sum level66 level15 level81)
(sum level66 level19 level85)
(sum level66 level23 level89)
(sum level66 level25 level91)
(sum level67 level8 level75)
(sum level67 level15 level82)
(sum level67 level19 level86)
(sum level67 level23 level90)
(sum level67 level25 level92)
(sum level68 level8 level76)
(sum level68 level15 level83)
(sum level68 level19 level87)
(sum level68 level23 level91)
(sum level68 level25 level93)
(sum level69 level8 level77)
(sum level69 level15 level84)
(sum level69 level19 level88)
(sum level69 level23 level92)
(sum level69 level25 level94)
(sum level70 level8 level78)
(sum level70 level15 level85)
(sum level70 level19 level89)
(sum level70 level23 level93)
(sum level70 level25 level95)
(sum level71 level8 level79)
(sum level71 level15 level86)
(sum level71 level19 level90)
(sum level71 level23 level94)
(sum level71 level25 level96)
(sum level72 level8 level80)
(sum level72 level15 level87)
(sum level72 level19 level91)
(sum level72 level23 level95)
(sum level72 level25 level97)
(sum level73 level8 level81)
(sum level73 level15 level88)
(sum level73 level19 level92)
(sum level73 level23 level96)
(sum level73 level25 level98)
(sum level74 level8 level82)
(sum level74 level15 level89)
(sum level74 level19 level93)
(sum level74 level23 level97)
(sum level74 level25 level99)
(sum level75 level8 level83)
(sum level75 level15 level90)
(sum level75 level19 level94)
(sum level75 level23 level98)
(sum level75 level25 level100)
(sum level76 level8 level84)
(sum level76 level15 level91)
(sum level76 level19 level95)
(sum level76 level23 level99)
(sum level76 level25 level101)
(sum level77 level8 level85)
(sum level77 level15 level92)
(sum level77 level19 level96)
(sum level77 level23 level100)
(sum level77 level25 level102)
(sum level78 level8 level86)
(sum level78 level15 level93)
(sum level78 level19 level97)
(sum level78 level23 level101)
(sum level78 level25 level103)
(sum level79 level8 level87)
(sum level79 level15 level94)
(sum level79 level19 level98)
(sum level79 level23 level102)
(sum level79 level25 level104)
(sum level80 level8 level88)
(sum level80 level15 level95)
(sum level80 level19 level99)
(sum level80 level23 level103)
(sum level80 level25 level105)
(sum level81 level8 level89)
(sum level81 level15 level96)
(sum level81 level19 level100)
(sum level81 level23 level104)
(sum level81 level25 level106)
(sum level82 level8 level90)
(sum level82 level15 level97)
(sum level82 level19 level101)
(sum level82 level23 level105)
(sum level82 level25 level107)
(sum level83 level8 level91)
(sum level83 level15 level98)
(sum level83 level19 level102)
(sum level83 level23 level106)
(sum level83 level25 level108)
(sum level84 level8 level92)
(sum level84 level15 level99)
(sum level84 level19 level103)
(sum level84 level23 level107)
(sum level84 level25 level109)
(sum level85 level8 level93)
(sum level85 level15 level100)
(sum level85 level19 level104)
(sum level85 level23 level108)
(sum level85 level25 level110)
(sum level86 level8 level94)
(sum level86 level15 level101)
(sum level86 level19 level105)
(sum level86 level23 level109)
(sum level86 level25 level111)
(sum level87 level8 level95)
(sum level87 level15 level102)
(sum level87 level19 level106)
(sum level87 level23 level110)
(sum level87 level25 level112)
(sum level88 level8 level96)
(sum level88 level15 level103)
(sum level88 level19 level107)
(sum level88 level23 level111)
(sum level88 level25 level113)
(sum level89 level8 level97)
(sum level89 level15 level104)
(sum level89 level19 level108)
(sum level89 level23 level112)
(sum level89 level25 level114)
(sum level90 level8 level98)
(sum level90 level15 level105)
(sum level90 level19 level109)
(sum level90 level23 level113)
(sum level90 level25 level115)
(sum level91 level8 level99)
(sum level91 level15 level106)
(sum level91 level19 level110)
(sum level91 level23 level114)
(sum level91 level25 level116)
(sum level92 level8 level100)
(sum level92 level15 level107)
(sum level92 level19 level111)
(sum level92 level23 level115)
(sum level92 level25 level117)
(sum level93 level8 level101)
(sum level93 level15 level108)
(sum level93 level19 level112)
(sum level93 level23 level116)
(sum level93 level25 level118)
(sum level94 level8 level102)
(sum level94 level15 level109)
(sum level94 level19 level113)
(sum level94 level23 level117)
(sum level94 level25 level119)
(sum level95 level8 level103)
(sum level95 level15 level110)
(sum level95 level19 level114)
(sum level95 level23 level118)
(sum level95 level25 level120)
(sum level96 level8 level104)
(sum level96 level15 level111)
(sum level96 level19 level115)
(sum level96 level23 level119)
(sum level96 level25 level121)
(sum level97 level8 level105)
(sum level97 level15 level112)
(sum level97 level19 level116)
(sum level97 level23 level120)
(sum level97 level25 level122)
(sum level98 level8 level106)
(sum level98 level15 level113)
(sum level98 level19 level117)
(sum level98 level23 level121)
(sum level98 level25 level123)
(sum level99 level8 level107)
(sum level99 level15 level114)
(sum level99 level19 level118)
(sum level99 level23 level122)
(sum level99 level25 level124)
(sum level100 level8 level108)
(sum level100 level15 level115)
(sum level100 level19 level119)
(sum level100 level23 level123)
(sum level100 level25 level125)
(sum level101 level8 level109)
(sum level101 level15 level116)
(sum level101 level19 level120)
(sum level101 level23 level124)
(sum level101 level25 level126)
(sum level102 level8 level110)
(sum level102 level15 level117)
(sum level102 level19 level121)
(sum level102 level23 level125)
(sum level102 level25 level127)
(sum level103 level8 level111)
(sum level103 level15 level118)
(sum level103 level19 level122)
(sum level103 level23 level126)
(sum level103 level25 level128)
(sum level104 level8 level112)
(sum level104 level15 level119)
(sum level104 level19 level123)
(sum level104 level23 level127)
(sum level104 level25 level129)
(sum level105 level8 level113)
(sum level105 level15 level120)
(sum level105 level19 level124)
(sum level105 level23 level128)
(sum level105 level25 level130)
(sum level106 level8 level114)
(sum level106 level15 level121)
(sum level106 level19 level125)
(sum level106 level23 level129)
(sum level106 level25 level131)
(sum level107 level8 level115)
(sum level107 level15 level122)
(sum level107 level19 level126)
(sum level107 level23 level130)
(sum level107 level25 level132)
(sum level108 level8 level116)
(sum level108 level15 level123)
(sum level108 level19 level127)
(sum level108 level23 level131)
(sum level108 level25 level133)
(sum level109 level8 level117)
(sum level109 level15 level124)
(sum level109 level19 level128)
(sum level109 level23 level132)
(sum level109 level25 level134)
(sum level110 level8 level118)
(sum level110 level15 level125)
(sum level110 level19 level129)
(sum level110 level23 level133)
(sum level110 level25 level135)
(sum level111 level8 level119)
(sum level111 level15 level126)
(sum level111 level19 level130)
(sum level111 level23 level134)
(sum level111 level25 level136)
(sum level112 level8 level120)
(sum level112 level15 level127)
(sum level112 level19 level131)
(sum level112 level23 level135)
(sum level112 level25 level137)
(sum level113 level8 level121)
(sum level113 level15 level128)
(sum level113 level19 level132)
(sum level113 level23 level136)
(sum level113 level25 level138)
(sum level114 level8 level122)
(sum level114 level15 level129)
(sum level114 level19 level133)
(sum level114 level23 level137)
(sum level114 level25 level139)
(sum level115 level8 level123)
(sum level115 level15 level130)
(sum level115 level19 level134)
(sum level115 level23 level138)
(sum level115 level25 level140)
(sum level116 level8 level124)
(sum level116 level15 level131)
(sum level116 level19 level135)
(sum level116 level23 level139)
(sum level116 level25 level141)
(sum level117 level8 level125)
(sum level117 level15 level132)
(sum level117 level19 level136)
(sum level117 level23 level140)
(sum level117 level25 level142)
(sum level118 level8 level126)
(sum level118 level15 level133)
(sum level118 level19 level137)
(sum level118 level23 level141)
(sum level118 level25 level143)
(sum level119 level8 level127)
(sum level119 level15 level134)
(sum level119 level19 level138)
(sum level119 level23 level142)
(sum level119 level25 level144)
(sum level120 level8 level128)
(sum level120 level15 level135)
(sum level120 level19 level139)
(sum level120 level23 level143)
(sum level120 level25 level145)
(sum level121 level8 level129)
(sum level121 level15 level136)
(sum level121 level19 level140)
(sum level121 level23 level144)
(sum level121 level25 level146)
(sum level122 level8 level130)
(sum level122 level15 level137)
(sum level122 level19 level141)
(sum level122 level23 level145)
(sum level122 level25 level147)
(sum level123 level8 level131)
(sum level123 level15 level138)
(sum level123 level19 level142)
(sum level123 level23 level146)
(sum level123 level25 level148)
(sum level124 level8 level132)
(sum level124 level15 level139)
(sum level124 level19 level143)
(sum level124 level23 level147)
(sum level124 level25 level149)
(sum level125 level8 level133)
(sum level125 level15 level140)
(sum level125 level19 level144)
(sum level125 level23 level148)
(sum level125 level25 level150)
(sum level126 level8 level134)
(sum level126 level15 level141)
(sum level126 level19 level145)
(sum level126 level23 level149)
(sum level126 level25 level151)
(sum level127 level8 level135)
(sum level127 level15 level142)
(sum level127 level19 level146)
(sum level127 level23 level150)
(sum level127 level25 level152)
(sum level128 level8 level136)
(sum level128 level15 level143)
(sum level128 level19 level147)
(sum level128 level23 level151)
(sum level128 level25 level153)
(sum level129 level8 level137)
(sum level129 level15 level144)
(sum level129 level19 level148)
(sum level129 level23 level152)
(sum level129 level25 level154)
(sum level130 level8 level138)
(sum level130 level15 level145)
(sum level130 level19 level149)
(sum level130 level23 level153)
(sum level130 level25 level155)
(sum level131 level8 level139)
(sum level131 level15 level146)
(sum level131 level19 level150)
(sum level131 level23 level154)
(sum level131 level25 level156)
(sum level132 level8 level140)
(sum level132 level15 level147)
(sum level132 level19 level151)
(sum level132 level23 level155)
(sum level132 level25 level157)
(sum level133 level8 level141)
(sum level133 level15 level148)
(sum level133 level19 level152)
(sum level133 level23 level156)
(sum level133 level25 level158)
(sum level134 level8 level142)
(sum level134 level15 level149)
(sum level134 level19 level153)
(sum level134 level23 level157)
(sum level134 level25 level159)
(sum level135 level8 level143)
(sum level135 level15 level150)
(sum level135 level19 level154)
(sum level135 level23 level158)
(sum level135 level25 level160)
(sum level136 level8 level144)
(sum level136 level15 level151)
(sum level136 level19 level155)
(sum level136 level23 level159)
(sum level137 level8 level145)
(sum level137 level15 level152)
(sum level137 level19 level156)
(sum level137 level23 level160)
(sum level138 level8 level146)
(sum level138 level15 level153)
(sum level138 level19 level157)
(sum level139 level8 level147)
(sum level139 level15 level154)
(sum level139 level19 level158)
(sum level140 level8 level148)
(sum level140 level15 level155)
(sum level140 level19 level159)
(sum level141 level8 level149)
(sum level141 level15 level156)
(sum level141 level19 level160)
(sum level142 level8 level150)
(sum level142 level15 level157)
(sum level143 level8 level151)
(sum level143 level15 level158)
(sum level144 level8 level152)
(sum level144 level15 level159)
(sum level145 level8 level153)
(sum level145 level15 level160)
(sum level146 level8 level154)
(sum level147 level8 level155)
(sum level148 level8 level156)
(sum level149 level8 level157)
(sum level150 level8 level158)
(sum level151 level8 level159)
(sum level152 level8 level160)

(connected l0 l1)
(fuelcost level19 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l3)
(fuelcost level19 l0 l3)
(connected l1 l0)
(fuelcost level19 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l3)
(fuelcost level15 l1 l3)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l3)
(fuelcost level8 l2 l3)
(connected l3 l0)
(fuelcost level19 l3 l0)
(connected l3 l1)
(fuelcost level15 l3 l1)
(connected l3 l2)
(fuelcost level8 l3 l2)

(at t0 l1)
(fuel t0 level160)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l0)
(at p4 l2)
(at p5 l1)
(at p6 l3)
(at p7 l0)
(at p8 l2)
(at p9 l0)
(at p10 l0)
(at p11 l2)
(at p12 l2)
(at p13 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l3)
(at p3 l1)
(at p4 l0)
(at p5 l3)
(at p6 l1)
(at p7 l3)
(at p8 l3)
(at p9 l1)
(at p10 l3)
(at p11 l3)
(at p12 l1)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 14
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 14
3. (drive t0 l1 l2 level135 level25 level160)
   deleted: (at t0 l1) (fuel t0 level160)
   added: (at t0 l2) (fuel t0 level135)
   goals met: 0 of 14
4. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 14
5. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 14
6. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 14
7. (load p12 t0 l2)
   deleted: (at p12 l2)
   added: (in p12 t0)
   goals met: 0 of 14
8. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 0 of 14
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 14
10. (drive t0 l2 l0 level112 level23 level135)
   deleted: (at t0 l2) (fuel t0 level135)
   added: (at t0 l0) (fuel t0 level112)
   goals met: 0 of 14
11. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 14
12. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 14
13. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 2 of 14
14. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 2 of 14
15. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 2 of 14
16. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 2 of 14
17. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 2 of 14
18. (drive t0 l0 l3 level93 level19 level112)
   deleted: (at t0 l0) (fuel t0 level112)
   added: (at t0 l3) (fuel t0 level93)
   goals met: 2 of 14
19. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 2 of 14
20. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 3 of 14
21. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 4 of 14
22. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 5 of 14
23. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 6 of 14
24. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 7 of 14
25. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 8 of 14
26. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 9 of 14
27. (drive t0 l3 l1 level78 level15 level93)
   deleted: (at t0 l3) (fuel t0 level93)
   added: (at t0 l1) (fuel t0 level78)
   goals met: 9 of 14
28. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 10 of 14
29. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 11 of 14
30. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 12 of 14
31. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 13 of 14
32. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 14 of 14
